Configuration/InformationRegisters/бит_ум_ДопДанныеФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ум_ДопДанныеФизЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимВъезда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ум_РежимыВъездаИР</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ум_СтатусыИР</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУбытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РучнойУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланируемаяДатаОкончанияТрудовойДеятельности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/InformationRegisters/бит_ум_ДопДанныеФизЛиц/Forms/ФормаЗаписиРасширенная/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		Запись.Период = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;

	Элементы.ГруппаСотрудникНеЯвляетсяИностранцем.Видимость = НЕ бит_ум_УчетМигрантовСервер.ЭтоИностранныйГражданин(Запись.Физлицо);
	
	НоваяЗапись = Запись.ИсходныйКлючЗаписи.Пустой();
	
	УправлениеЭУ(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		
		бит_ум_ДопДанныеФизЛиц = РегистрыСведений.бит_ум_ДопДанныеФизЛиц.СоздатьМенеджерЗаписи();
		бит_ум_ДопДанныеФизЛиц.Период = Запись.ИсходныйКлючЗаписи.Период;
		бит_ум_ДопДанныеФизЛиц.Физлицо = Запись.ИсходныйКлючЗаписи.Физлицо;
		бит_ум_ДопДанныеФизЛиц.Прочитать();
		
		СтруктураСтаройЗаписи = Новый Структура("Период, Физлицо, РежимВъезда, Статус, ДатаПрибытия, ДатаУбытия,
			|РучнойУчет, ПланируемаяДатаОкончанияТрудовойДеятельности");
		ЗаполнитьЗначенияСвойств(СтруктураСтаройЗаписи, бит_ум_ДопДанныеФизЛиц);
		ПараметрыЗаписи.Вставить("СтруктураСтаройЗаписи", СтруктураСтаройЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ПараметрыЗаписи.Свойство("СтруктураСтаройЗаписи") Тогда
		
		// Если была изменена дата и хотя бы одно из полей, тогда сохраним прежнюю запись	
		Если (НЕ ТекущийОбъект.Период = ПараметрыЗаписи.СтруктураСтаройЗаписи.Период
				И (НЕ ТекущийОбъект.РежимВъезда = ПараметрыЗаписи.СтруктураСтаройЗаписи.РежимВъезда
					ИЛИ НЕ ТекущийОбъект.Статус = ПараметрыЗаписи.СтруктураСтаройЗаписи.Статус
					ИЛИ НЕ ТекущийОбъект.ДатаПрибытия = ПараметрыЗаписи.СтруктураСтаройЗаписи.ДатаПрибытия
					ИЛИ НЕ ТекущийОбъект.ДатаУбытия = ПараметрыЗаписи.СтруктураСтаройЗаписи.ДатаУбытия
					ИЛИ НЕ ТекущийОбъект.РучнойУчет = ПараметрыЗаписи.СтруктураСтаройЗаписи.РучнойУчет
					ИЛИ НЕ ТекущийОбъект.ПланируемаяДатаОкончанияТрудовойДеятельности
					= ПараметрыЗаписи.СтруктураСтаройЗаписи.ПланируемаяДатаОкончанияТрудовойДеятельности)) Тогда
					
			бит_ум_ДопДанныеФизЛиц = РегистрыСведений.бит_ум_ДопДанныеФизЛиц.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(бит_ум_ДопДанныеФизЛиц, ТекущийОбъект);
			ЗаполнитьЗначенияСвойств(бит_ум_ДопДанныеФизЛиц, ПараметрыЗаписи.СтруктураСтаройЗаписи);
			бит_ум_ДопДанныеФизЛиц.Записать();
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(Запись.ДатаПрибытия) И ЗначениеЗаполнено(Запись.ДатаУбытия) И Запись.ДатаУбытия <= Запись.ДатаПрибытия Тогда
		ТекстСообщения = НСтр("ru = 'Дата убытия должна быть больше даты прибытия.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Запись.ДатаУбытия", , Отказ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если НоваяЗапись Тогда
		
		ТекстВопроса = НСтр("ru = 'Заполнить список документов иностранного работника, необходимых для ввода в программу?'");
		
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьСписокДокументовЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, НСтр("ru = 'Заполнение списка документов'"));
		
	КонецЕсли;
	
	НоваяЗапись = Ложь;
	
	УправлениеЭУ(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИсторияИзменений(Команда)

	Отбор = Новый Структура("Физлицо");
	ЗаполнитьЗначенияСвойств(Отбор, Запись);
	
	ОткрытьФорму("РегистрСведений.бит_ум_ДопДанныеФизЛиц.ФормаСписка", Новый Структура("Отбор", Отбор));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеЭУ(Форма)
	
	Форма.Элементы.ГруппаДополнительныеДанныеНеЗаписаны.Видимость = Форма.НоваяЗапись;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокДокументовЗавершение(Знач Результат, Знач ПараметрКоманды) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	
	
	ЗаполнитьСписокДокументов(Запись.Физлицо, Запись.РежимВъезда, Запись.Статус);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДокументов(Физлицо, РежимВъезда, Статус)
	
	бит_ум_УчетМигрантовСервер.СформироватьЗаписиПоДокументам(Физлицо, РежимВъезда, Статус, ТекущаяДатаСеанса());
	
КонецПроцедуры

#КонецОбласти
